import { createStore } from "vuex";

export default createStore({
  state: {
    books: [
      {
        id: 1,
        title: "Прості Істини",
        author: "Богдан Задура",
        price: 250,
        genre: "Філософія",
        image:
          "https://img.imageboss.me/vsl/width/1024/format:webp/2024-10-18/IMG_0248.png",
        novelty: true,
        description:
          "Поетична збірка «Прості істини» Богдана Задури — відомого польського поета, перекладача, прозаїка, літературного критика — потребує глибокого читання, наче глибокого дихання. Але водночас вірші Задури є запрошенням читача до рівноправного діалогу. Його іронічні тексти різних років — часто трагічні, містять безліч алюзій, прихованих цитат і посилань на історичні події, впізнавання яких — особлива читацька насолода та важливий шлях, який кожен мусить пройти з книжкою сам на сам. Завдяки перекладам українською Василя Махна й Анни Грувер ця збірка зберігає інтонацію Богдана Задури і надає можливість відкрити для себе цього легендарного сучасника або продовжити знайомство з його поезією.",
      },
      {
        id: 2,
        title: "Замість яблук",
        author: "Іванна Скиба-Якубова",
        price: 350,
        genre: "Роман",
        image:
          "https://img.imageboss.me/vsl/width/1024/format:webp/2024-10-10/978-966-448-347-3_2.png",
        novelty: false,
        description:
          "Поетична збірка Іванни Скиби-Якубової «Замість яблук» це дві частини, два життя. У першій — вірші, написані до 24 лютого 2022 року. Первісно-міфологічні, навіть хтонічні. Дуже тілесні, чуттєві, намацально-прозорі. У другій — вірші, написані після 24 лютого 2022 року, вже в новій реальності. В «До» жінки ще сперечаються з богом, в «Після» вже відверто йому протистоять. Беруть у руки зброю, захищають землю, врешті, народжують новий світ після смерті старого. І дарують віру в те, що він, цей світ, виживе.",
      },
      {
        id: 3,
        title: "Любовні листи на Різдво",
        author: "Сью Муркрофт",
        price: 400,
        genre: "Любовний роман",
        image:
          "https://img.imageboss.me/vsl/width/1024/format:webp/2024-10-11/978-966-448-372-5_2.png",
        novelty: false,
        description:
          "Життя Медді, її маленької доньки Лайли та бабусі Руті в «Падубах» — затишному будинку біля Північного моря — плине своїм звичним руслом, аж поки в ньому не з’являється таємничий незнайомець. А разом із ним — приховані події минулого Руті та почуття, якому Медді не може опиратися. Проте щойно вона вирішує відкрити серце любові, як до неї починають надходити повідомлення від давно зниклого чоловіка. Клубочок заплутаних подій, які трапляються у передріздвяний час, не раз змушують Руті й Медді страждати, однак ці тендітні, проте сильні жінки заслуговують на щастя. А Різдво — найкращий час для того, аби бути щасливими.",
      },
      {
        id: 4,
        title: "Звукозапис душі",
        author: "Богдан Манюк",
        price: 450,
        genre: "Поезія",
        image:
          "https://img.imageboss.me/vsl/width/1024/format:webp/2024-08-27/978-966-448-356-5_2.png",
        novelty: false,
        description:
          "«Звукозапис душі» — поетична збірка вибраних поезій автора з Тернопільщини, що захоплять несподіваними й гармонійними образами як читача юного, так і поважного віку. Щирі одкровення у віршах сповнені національним колоритом, бо немає нічого справжнього, як вважає автор, без свого, рідного, з молоком неньки увібраного з перших днів життя.",
      },
      {
        id: 5,
        title: "Кохання та удача",
        author: "Дженна Еванс Велч",
        price: 350,
        genre: "Пригоди",
        image:
          "https://img.imageboss.me/vsl/width/1024/format:webp/2024-08-27/978-966-448-335-0_2.png",
        novelty: false,
        description:
          "«Кохання та удача» Дженни Еванс Велч — це підлітковий роман про дорослішання, стосунки, зраду та дружбу на тлі неймовірної мандрівки Смарагдовим островом. Адді та її брата Яна покарано за суперечку на весіллі тітоньки. Це було навіть весело, бо ж погодьтеся, не часто під час весільної фотосесії побачиш брата і сестру, які сторчголов скочуються з гори в болото. Мама відправляє їх до подруги Ліни в Італію, подумати про життя і свою поведінку. Та вона і підозрювати не могла, що замість подорожі в Італію її дорослі дітки здійснять мандрівку Ірландією, та ще й старою автівкою, котрою кермуватиме хлопець, якого вони майже не знають. Адді не випускає з рук путівник «Ірландія для зцілення серця», намагається налагодити стосунки з братом, зберегти теплий родинний зв'язок та розібратися в собі.",
      },
      {
        id: 6,
        title: "Усі ті розбиті місця",
        author: "Джон Бойн",
        price: 450,
        genre: "Поезія",
        image:
          "https://img.imageboss.me/vsl/width/1024/format:webp/2024-08-08/978-966-448-354-1_2.png",
        novelty: true,
        description:
          "Дев’яностооднорічна Ґретель Фернсбі вже декілька десятиліть мешкає в елітному будинку в Лондоні. Її життя тихе та спокійне, проте за плечима жінки темне минуле. Вона нікому не розповідає про свою втечу з нацистської Німеччини у віці дванадцяти років, про важкі повоєнні роки, які збувала у Франції з матір’ю. Та найменше вона воліє згадувати про свого батька, який був комендантом одного з найбільших концтаборів, та сімейну трагедію.",
      },
      {
        id: 7,
        title: "Будуйте. Нетиповий посібник для створення значущих речей",
        author: "Тоні Фаделл",
        price: 500,
        genre: "Нон-фікшн",
        image:
          "https://img.imageboss.me/vsl/width/1024/format:webp/2024-08-07/978-966-448-149-3_2.png",
        novelty: false,
        description:
          "«Будуйте» — енциклопедія корисних знань для людей із креативним мисленням, які прагнуть створювати інноваційні та значущі продукти. Тоні Фаделл, знаний американський топ-менеджер і наставник, був частиною команд зі створення відомих брендів, як-от iPod, iPhone, Nest Learning Thermostat і Nest Protect. Захопливо й відверто він розповідає про шлях, яким ішов, аналізуючи вдалі рішення, а також помилки, які скоїв. У цій підбірці інсайтів, інстинктів і мудрості автор дає не готові рішення, а поради із власного досвіду щодо розроблення, запуску, масштабування і навіть продажу бізнесу. Ця книжка допоможе вам зрозуміти, як стати людиною, якою ви хочете бути, і як сформувати команду, що допоможе вам створити щось дивовижне. Буде цікавою для широкого кола читачів.",
      },
      {
        id: 8,
        title: "Це Моне",
        author: "Сара Паппворт",
        price: 400,
        genre: "Нон-фікшн",
        image:
          "https://img.imageboss.me/vsl/width/1024/format:webp/2021-10-21/vfjfwni6duplgkjca8wu.png",
        novelty: false,
        description:
          "Клод Моне — французький художник, найбільш відомий як головний представник напрочуд впливової авангардної групи — імпресіоністів. Він прожив довге й плідне, сповнене творчості життя, любив експериментувати з новими техніками малювання, а втім, його роботи ніколи не базувалися на мистецьких теоріях, лише на швидкоплинних враженнях. Він часто прокидався удосвіта, щоб встигнути зловити, приміром літній світанок над Сеною.",
      },
      {
        id: 9,
        title: "Барва пурпурова",
        author: "Еліс Вокер",
        price: 300,
        genre: "Класична",
        image:
          "https://img.imageboss.me/vsl/width/1024/format:webp/2024-07-31/978-966-448-352-7_2.png",
        novelty: false,
        description:
          "«Звукозапис душі» — поетична збірка вибраних поезій автора з Тернопільщини, що захоплять несподіваними й гармонійними образами як читача юного, так і поважного віку. Щирі одкровення у віршах сповнені національним колоритом, бо немає нічого справжнього, як вважає автор, без свого, рідного, з молоком неньки увібраного з перших днів життя.",
      },
    ],
    favorites: [],
    cart: [],
  },
  mutations: {
    toggleFavorite(state, book) {
      const index = state.favorites.findIndex((fav) => fav.id === book.id);
      if (index === -1) {
        state.favorites.push(book);
      } else {
        state.favorites.splice(index, 1);
      }
    },
    addToCart(state, item) {
      const existingItem = state.cart.find(
        (cartItem) => cartItem.id === item.id
      );
      if (existingItem) {
        existingItem.quantity++;
      } else {
        state.cart.push(item);
      }
      localStorage.setItem("cart", JSON.stringify(state.cart));
    },
    removeFromCart(state, item) {
      const index = state.cart.indexOf(item);
      if (index !== -1) {
        state.cart.splice(index, 1);
      }
      localStorage.setItem("cart", JSON.stringify(state.cart));
    },
    clearCart(state) {
      state.cart = [];
      localStorage.removeItem("cart");
    },
    checkout(state) {
      console.log("Покупка завершена");
      state.cart = [];
    },
  },
  actions: {
    toggleFavorite({ commit }, book) {
      commit("toggleFavorite", book);
    },
    addToCart({ commit }, item) {
      commit("addToCart", item);
    },
    removeFromCart({ commit }, item) {
      commit("removeFromCart", item);
    },
    clearCart({ commit }) {
      commit("clearCart");
    },
    checkout({ commit }) {
      commit("checkout");
    },
  },
  getters: {
    books: (state) => state.books,
    cart: (state) => state.cart,
    favorites: (state) => state.favorites,
  },
});
